# Filling missing values

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("weather_data.csv")
print(df)

          day  temperature  windspeed   event
0  01-01-2017         32.0        6.0    Rain
1  01-04-2017          NaN        9.0   Sunny
2  01-05-2017         18.0        NaN    Snow
3  01-06-2017          NaN        7.0     NaN
4  01-07-2017         32.0        NaN    Rain
5  01-08-2017          NaN        NaN   Sunny
6  01-09-2017          NaN        NaN     NaN
7  01-10-2017         34.0        8.0  Cloudy
8  01-11-2017         40.0       12.0   Sunny

In [3]:
df=df.set_index('day')

In [4]:
new_df=df

In [5]:
#replace null value with 0
new_df=df.fillna(0)

In [6]:
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017          0.0        9.0   Sunny
01-05-2017         18.0        0.0    Snow
01-06-2017          0.0        7.0       0
01-07-2017         32.0        0.0    Rain
01-08-2017          0.0        0.0   Sunny
01-09-2017          0.0        0.0       0
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [7]:
new_df=df.fillna({
    'temperature': 0,
    'windspeed': 0,
    'event': 'No event'
})
new_df

            temperature  windspeed     event
day
01-01-2017         32.0        6.0      Rain
01-04-2017          0.0        9.0     Sunny
01-05-2017         18.0        0.0      Snow
01-06-2017          0.0        7.0  No event
01-07-2017         32.0        0.0      Rain
01-08-2017          0.0        0.0     Sunny
01-09-2017          0.0        0.0  No event
01-10-2017         34.0        8.0    Cloudy
01-11-2017         40.0       12.0     Sunny

In [8]:
new_df=df.fillna(method='bfill')

In [9]:
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017         18.0        9.0   Sunny
01-05-2017         18.0        7.0    Snow
01-06-2017         32.0        7.0    Rain
01-07-2017         32.0        8.0    Rain
01-08-2017         34.0        8.0   Sunny
01-09-2017         34.0        8.0  Cloudy
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [10]:
new_df=df.fillna(method='ffill')

In [11]:
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017         32.0        9.0   Sunny
01-05-2017         18.0        9.0    Snow
01-06-2017         18.0        7.0    Snow
01-07-2017         32.0        7.0    Rain
01-08-2017         32.0        7.0   Sunny
01-09-2017         32.0        7.0   Sunny
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [12]:
new_df=df.fillna(method='ffill',limit=1)
#there we give limit to fill only one forward fill

In [13]:
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017         32.0        9.0   Sunny
01-05-2017         18.0        9.0    Snow
01-06-2017         18.0        7.0    Snow
01-07-2017         32.0        7.0    Rain
01-08-2017         32.0        NaN   Sunny
01-09-2017          NaN        NaN   Sunny
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [14]:
new_df=df.fillna(method='ffill',limit=1,axis=1)

In [15]:
new_df

           temperature windspeed   event
day
01-01-2017        32.0       6.0    Rain
01-04-2017         NaN       9.0   Sunny
01-05-2017        18.0      18.0    Snow
01-06-2017         NaN       7.0     7.0
01-07-2017        32.0      32.0    Rain
01-08-2017         NaN       NaN   Sunny
01-09-2017         NaN       NaN     NaN
01-10-2017        34.0       8.0  Cloudy
01-11-2017        40.0      12.0   Sunny

In [16]:
new_df=df.interpolate()

In [17]:
new_df

            temperature  windspeed   event
day
01-01-2017    32.000000       6.00    Rain
01-04-2017    25.000000       9.00   Sunny
01-05-2017    18.000000       8.00    Snow
01-06-2017    25.000000       7.00     NaN
01-07-2017    32.000000       7.25    Rain
01-08-2017    32.666667       7.50   Sunny
01-09-2017    33.333333       7.75     NaN
01-10-2017    34.000000       8.00  Cloudy
01-11-2017    40.000000      12.00   Sunny

# dropping row

In [18]:
new_df=df.dropna()

In [19]:
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [20]:
new_df=df.dropna(how='all')
#delete row which contains all null value
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017          NaN        9.0   Sunny
01-05-2017         18.0        NaN    Snow
01-06-2017          NaN        7.0     NaN
01-07-2017         32.0        NaN    Rain
01-08-2017          NaN        NaN   Sunny
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [21]:
new_df=df.dropna(thresh=1)
#drop not null 1

In [22]:
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017          NaN        9.0   Sunny
01-05-2017         18.0        NaN    Snow
01-06-2017          NaN        7.0     NaN
01-07-2017         32.0        NaN    Rain
01-08-2017          NaN        NaN   Sunny
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [23]:
new_df=df.dropna(thresh=2)
new_df

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017          NaN        9.0   Sunny
01-05-2017         18.0        NaN    Snow
01-07-2017         32.0        NaN    Rain
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [24]:
df.dropna(thresh=0.3*len(df.columns))
#it will drop those rows which rows have 30% data only

            temperature  windspeed   event
day
01-01-2017         32.0        6.0    Rain
01-04-2017          NaN        9.0   Sunny
01-05-2017         18.0        NaN    Snow
01-06-2017          NaN        7.0     NaN
01-07-2017         32.0        NaN    Rain
01-08-2017          NaN        NaN   Sunny
01-10-2017         34.0        8.0  Cloudy
01-11-2017         40.0       12.0   Sunny

In [26]:
df.dropna(thresh=7,axis=1)

             event
day
01-01-2017    Rain
01-04-2017   Sunny
01-05-2017    Snow
01-06-2017     NaN
01-07-2017    Rain
01-08-2017   Sunny
01-09-2017     NaN
01-10-2017  Cloudy
01-11-2017   Sunny

# adding between dates in dataset

In [27]:
df.iloc[7]
#it's shows the discription of 7th position

temperature      34.0
windspeed         8.0
event          Cloudy
Name: 01-10-2017, dtype: object